package org.asd._19_12_2024;

public class E1 {
    /**
     * 1. Напишите метод, который принимает два массива строк одинаковой длины и возвращает массив,
     * содержащий строки, составленные из соответствующих строк двух массивов в обратном порядке.
     */

/**
 * 2. Напишите метод, который принимает массив целых чисел и массив строк,
 * и возвращает количество строк, чья длина больше, чем соответствующее число в массиве чисел.
 */

/**
 * 3. Напишите метод, который принимает массив символов и массив строк,
 * и возвращает массив, где строки содержат только символы из соответствующего элемента массива символов.
 */

/**
 * 4. Напишите метод, который принимает два массива целых чисел одинаковой длины
 * и возвращает массив, содержащий разность квадратов соответствующих чисел.
 */

/**
 * 5. Напишите метод, который принимает массив логических значений и массив строк,
 * и возвращает массив строк, где каждое значение true добавляет "(valid)" к соответствующей строке.
 */

/**
 * 6. Напишите метод, который принимает два массива строк одинаковой длины
 * и возвращает массив строк, где каждая строка — это объединение строк из обоих массивов с добавлением их длин.
 */

/**
 * 7. Напишите метод, который принимает массив чисел с плавающей точкой и массив целых чисел,
 * и возвращает массив, содержащий произведения соответствующих элементов.
 */

/**
 * 8. Напишите метод, который принимает два массива символов и возвращает массив символов,
 * которые присутствуют в обоих массивах.
 */

/**
 * 9. Напишите метод, который принимает массив строк и массив чисел,
 * и возвращает true, если все строки массива имеют длину, равную соответствующему числу.
 */

/**
 * 10. Напишите метод, который принимает два массива строк и возвращает строку,
 * содержащую чередующиеся элементы из двух массивов.
 */

}