package org.asd._19_12_2024;

public class Q1 {
    /**
     *
     */

/**
 * 1. Напишите метод, который принимает массив объектов "User" (!!!! класссы из E6 ьерем за основу) и выводит их имена в консоль.
 */

/**
 * 2. Напишите метод, который принимает массив объектов "Admin" и возвращает список всех привилегий.
 */

/**
 * 3. Напишите метод, который принимает массив объектов "Customer" и подсчитывает общее количество заказов у всех клиентов.
 */

/**
 * 4. Напишите метод, который принимает массив объектов "Order" и возвращает общую сумму всех заказов.
 */

/**
 * 5. Напишите метод, который принимает массив объектов "Product" и возвращает массив названий всех продуктов.
 */

/**
 * 6. Напишите метод, который принимает массив объектов "Order" и выводит в консоль идентификатор каждого заказа и его общую сумму.
 */

/**
 * 7. Напишите метод, который принимает массив объектов "User" и возвращает массив объектов "Admin" (используйте проверку типа).
 */

/**
 * 8. Напишите метод, который принимает массив объектов "Product" и возвращает продукт с максимальной ценой.
 */

/**
 * 9. Напишите метод, который принимает массив объектов "Order" и возвращает массив заказов, общая сумма которых превышает заданное значение.
 */

/**
 * 10. Напишите метод, который принимает массив объектов "Customer" и возвращает список клиентов, у которых нет ни одного заказа.
 */

}
