package org.asd._19_12_2024;

public class Q2 {

/**
 * 1. Напишите метод, который принимает массив объектов "Order" и возвращает список продуктов,
 *    которые встречаются в более чем одном заказе.
 */

/**
 * 2. Напишите метод, который принимает массив объектов "Customer" и возвращает клиента с наибольшей общей суммой заказов.
 */

/**
 * 3. Напишите метод, который принимает массив объектов "Product" и массив объектов "Order",
 *    и возвращает список продуктов, которые ни разу не были заказаны.
 */

/**
 * 4. Напишите метод, который принимает массив объектов "Order" и возвращает список заказов,
 *    отсортированных по их общей сумме (по убыванию).
 */

/**
 * 5. Напишите метод, который принимает массив объектов "User" и возвращает список всех клиентов,
 *    у которых заказы содержат более 3 продуктов.
 */

/**
 * 6. Напишите метод, который принимает массив объектов "Order" и возвращает карту (Map),
 *    где ключ — это "Customer", а значение — список заказов этого клиента.
 */

/**
 * 7. Напишите метод, который принимает массив объектов "Admin" и возвращает список привилегий,
 *    которые имеют все администраторы (общие привилегии).
 */

/**
 * 8. Напишите метод, который принимает массив объектов "Customer" и возвращает карту (Map),
 *    где ключ — это имя клиента, а значение — общая сумма всех его заказов.
 */

/**
 * 9. Напишите метод, который принимает массив объектов "Order" и возвращает продукт,
 *    который чаще всего встречается в заказах.
 */

/**
 * 10. Напишите метод, который принимает массив объектов "Order" и возвращает карту (Map),
 *     где ключ — это месяц (тип String), а значение — общая сумма всех заказов за этот месяц.
 */
}
